import styled from "styled-components";
import historyPng from '../../assets/history.jpg'

const About = () => {
    return (
        
        <AboutContainer>
            <div style={{display:'flex', justifyContent:'center'}}>
            <h1 style={{textAlign:"center", fontSize:'48px', borderBottom:"5px solid #023047",width:'160px'}}>Про нас</h1>
        </div>
            <div>
                <h1>Воєнна історія</h1>
                <p>24 серпня 1991 року Верховна Рада України прийняла постанову «Про військові формування в Україні», якою визначила: «підпорядкувати всі військові формування, дислоковані на території України, Верховній Раді України; утворити Міністерство оборони України; Урядові України приступити до створення Збройних Сил України». Фактично цією постановою було покладено початок будівництва Збройних Сил України як важливого інституту держави і невід’ємного елемента її воєнної організації.</p>
                <p>Історію будівництва Збройних Сил України можна поділити на ряд основних етапів: перший етап — формування основ Збройних Сил України (1991–1996 рр.); другий етап — подальше будівництво Збройних Сил України (1997–2000 рр.); третій етап — реформування Збройних Сил України (2001–2005 рр.); четвертий етап — розвиток Збройних Сил України (2006–2011 рр.). З 2012 по 2017 роки планувалося здійснити новий етап військової реформи — реформування і розвитку Збройних Сил України. Однак у зв’язку з агресією Російської Федерації виконання заходів даного етапу було зупинено.</p>
                <p>Восени — взимку 1991 року були підготовлені важливі документи, що стали нормативно-правовою базою формування Збройних Сил України.</p>
                <p>11 жовтня 1991 року Верховна Рада України затвердила Концепцію оборони і будівництва Збройних Сил України та постановила створити Раду оборони України, затвердила склад посадових осіб, які до неї входять, а також Положення про Раду оборони України.</p>
                <p>У Концепції передбачалося, що Україна поступово, з урахуванням усіх факторів національної безпеки, реалізуватиме намір стати в майбутньому нейтральною, без’ядерною державою, яка не братиме участі у військових блоках, натомість дотримуватиметься усіх договорів і угод щодо незастосування ядерної зброї. Концепція визначала, що Збройні Сили України складатимуться з трьох видів: Сухопутних військ (Військ наземної оборони), Військово-Повітряних Сил і Сил Протиповітряної оборони (Військ повітряної оборони), Військово-Морських Сил. У Концепції було визначено повноваження Міністра оборони України і Головного штабу Збройних Сил України.</p>
                <img src={historyPng} alt='history'></img>
                <p>Однією з найважливіших і суперечливих проблем у всьому комплексі питань військової сфери була проблема ядерної зброї. Після розпаду Радянського Союзу Україна стала власником третього за величиною ядерного потенціалу у світі. На озброєнні військових формувань в Україні знаходилося 130 міжконтинентальних ракет РС-18 на рідкому паливі з шістьма ядерними боєголовками кожна і 46 ракет РС-22 на твердому паливі з десятьма боєголовками. В усьому світі ці ракети були відомі як СС-19 та СС‑24 відповідно. В Україні було також розгорнуто повітряний компонент стратегічних сил, який складали 21 бомбардувальник ТУ-95мс та 19 бомбардувальників ТУ-160 з боєкомплектом до 500 крилатих ядерних ракет.</p>
                <p>Верховна Рада України затвердила принцип без’ядерності, закріплений у Декларації про державний суверенітет України від 16 липня 1990 року. Україна зобов’язалась вивезти до Росії ядерну зброю для її розукомплектування під спільним контролем. Виходячи з проголошених зобов’язань щодо без’ядерного статусу, Україна обрала компромісний і найбільш реальний у тих умовах шлях забезпечення своєї безпеки — шлях ядерного роззброєння. Концепція його розкривалася у формулі: ядерне роззброєння в обмін на спільний контроль за цим процесом, фінансову компенсацію і гарантії національної безпеки.</p>
                <p>6 грудня 1991 року Верховна Рада України приймає надзвичайно важливі для військового будівництва закони — «Про оборону України» і «Про Збройні Сили України». Того ж дня було затверджено текст Військової присяги, яку в залі Верховної Ради першим склав Міністр оборони України генерал-полковник К.П. Морозов. 3 січня 1992 року розпочався процес приведення до добровільної присяги на вірність народові України дислокованих на українській території військ.</p>
                <p>Указом Президента України від 5 квітня 1992 року № 209 на базі сил Чорноморського флоту почалося формування органів управління Військово-Морських Сил України.</p>
                <p>У середині червня 1992 року Верховна Рада України ратифікувала Договір про звичайні збройні сили в Європі, яким визначалися максимальні рівні озброєння і військової техніки для України. Необхідно було скорочувати кількість танків на 5300 одиниць, бойових броньованих машин — на 2400 одиниць, бойових літаків — на 477 одиниць. До реалізації цих завдань Україна приступила вже 18 серпня 1992 року.</p>
                <p>Згідно з Указом Президента України від 28 січня 1993 року на базі Військово-Повітряних Сил України та Військ Протиповітряної оборони України розпочалося формування єдиного виду Збройних Сил України — Військ Повітряної оборони. Остаточне їх об’єднання передбачалося завершити до 30 листопада 1995 року.</p>
                <p>19 жовтня 1993 року Верховна Рада України розглянула План проведення організаційних заходів у Збройних Силах України. Було прийнято Постанову «Про загальну структуру, чисельність та матеріально-технічне забезпечення Збройних Сил України», якою було визначено чисельність Збройних Сил України — 455 тис. військовослужбовців. На цьому ж засіданні Верховної Ради України була затверджена Воєнна доктрина України, яка визначила необхідність приведення системи оборони країни у відповідність до сучасних геополітичних і геостратегічних умов, переглянути та уточнити завдання і зміст діяльності всіх державних структур, організацій і закладів, причетних до забезпечення воєнної безпеки України.</p>
                <br></br>
                <br></br>
                <br></br>
            </div>
        </AboutContainer>
    );

}

const AboutContainer = styled.div`
  display: flex;
  justify-content: center;
  flex-direction: column;
  padding: 0 60px;

  img {
    width: 100%;
    max-width: 1590px;
    height: auto; 
  }

  p {
    font-size: 18px;
  }

  // Media query for tablets
  @media (max-width: 1024px) {
    padding: 0 30px; 

    p {
      font-size: 16px; 
    }
  }

  // Media query for mobile devices
  @media (max-width: 768px) {
    padding: 0 15px; 

    p {
      font-size: 14px; 
    }
  }
`;

export default About;